api/app/controllers/cars_controller.rb

  def index
    cars = Car.all
---
SELECT "cars".* FROM "cars"

  def create
    car = Car.new(car_params)

    if car.save
      # Attach images if present
      car.images.attach(params[:images]) if params[:images]
---
INSERT INTO "cars" ("model", "Year_of_manufucture", "condition", "color_in", "color_out", "registered", "milage", "transmission", "body", "fuel", "engine_size", "horse_power", "description", "price", "location", "contact", "name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
INSERT INTO "cars" ("model", "year_of_manufucture", "condition", "color_in", "color_out", "registered", "milage", "transmission", "body", "fuel", "engine_size", "horse_power", "description", "price", "location", "contact", "name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"

  def set_car
    @car = if params[:id]
             Car.find(params[:id])
           elsif params[:car]
             Car.find_by(model: params[:car][:model]) # Add other attributes if needed
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "cars".* FROM "cars" WHERE "cars"."model" = $1 LIMIT $2  [["model", "Toyota Corolla"], ["LIMIT", 1]]