api/app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id]) # Fetch post by ID
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]