api/app/controllers/posts_controller.rb

INSERT INTO "posts" ("model", "year_of_manufacture", "condition", "color_in", "color_out", "registered", "mileage", "transmission", "body", "fuel", "engine_size", "horse_power", "description", "price", "location", "contact", "name", "created_at", "updated_at", "title", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
INSERT INTO "posts" ("model", "year_of_manufacture", "condition", "color_in", "color_out", "registered", "mileage", "transmission", "body", "fuel", "engine_size", "horse_power", "description", "price", "location", "contact", "name", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    Rails.logger.info "Received parameters: #{params.inspect}" # Debugging log

    @post = Post.new(post_params) # Use the filtered parameters

    if params[:images].present?
      params[:images].each do |image|
        @post.images.attach(image) unless image.blank?
      end
    end

    if @post.save

UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2025-03-28 10:38:18.305655"], ["id", 8]]
---
  def update
    Rails.logger.info "Updating post with ID: #{@post.id} with params: #{params.inspect}"

    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
  def destroy
    Rails.logger.info "Deleting post with ID: #{@post.id}"

    @post.destroy!