api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "testuser"], ["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2025-01-23 14:24:08.997281"], ["updated_at", "2025-01-23 14:24:08.997281"]]
---
  def register
    @user = User.new(user_params)
    if @user.save